issue754/test1/mysql1_thr128.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            9182808
        write:                           0
        other:                           0
        total:                           9182808
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 9182808 (152991.94 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0215s
    total number of events:              170052
    total time taken by event execution: 7681.3906s
    response time:
         min:                                  8.17ms
         avg:                                 45.17ms
         max:                                528.84ms
         approx.  95 percentile:              83.54ms

Threads fairness:
    events (avg/stddev):           1328.5312/30.74
    execution time (avg/stddev):   60.0109/0.01