issue754/test1/mysql1_thr16.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            5688414
        write:                           0
        other:                           0
        total:                           5688414
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 5688414 (94556.13 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1591s
    total number of events:              105341
    total time taken by event execution: 961.9293s
    response time:
         min:                                  7.41ms
         avg:                                  9.13ms
         max:                                372.95ms
         approx.  95 percentile:               8.46ms

Threads fairness:
    events (avg/stddev):           6583.8125/80.44
    execution time (avg/stddev):   60.1206/0.04