issue754/test1/mysql1_thr256.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8545662
        write:                           0
        other:                           0
        total:                           8545662
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8545662 (142302.52 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0528s
    total number of events:              158253
    total time taken by event execution: 15366.7901s
    response time:
         min:                                  7.94ms
         avg:                                 97.10ms
         max:                                700.51ms
         approx.  95 percentile:             215.84ms

Threads fairness:
    events (avg/stddev):           618.1758/18.56
    execution time (avg/stddev):   60.0265/0.01