issue754/test1/mysql1_thr32.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8159616
        write:                           0
        other:                           0
        total:                           8159616
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8159616 (135973.24 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0090s
    total number of events:              151104
    total time taken by event execution: 1920.0684s
    response time:
         min:                                  8.13ms
         avg:                                 12.71ms
         max:                                572.02ms
         approx.  95 percentile:              14.81ms

Threads fairness:
    events (avg/stddev):           4722.0000/495.53
    execution time (avg/stddev):   60.0021/0.00