issue754/test1/mysql1_thr512.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8464986
        write:                           0
        other:                           0
        total:                           8464986
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8464986 (140612.28 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2009s
    total number of events:              156759
    total time taken by event execution: 30752.3247s
    response time:
         min:                                  7.79ms
         avg:                                196.18ms
         max:                               1187.62ms
         approx.  95 percentile:             444.58ms

Threads fairness:
    events (avg/stddev):           306.1699/11.13
    execution time (avg/stddev):   60.0631/0.03