issue754/test1/mysql1_thr64.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            9552708
        write:                           0
        other:                           0
        total:                           9552708
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 9552708 (159177.85 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0128s
    total number of events:              176902
    total time taken by event execution: 3840.3125s
    response time:
         min:                                  8.14ms
         avg:                                 21.71ms
         max:                                393.68ms
         approx.  95 percentile:              29.96ms

Threads fairness:
    events (avg/stddev):           2764.0938/80.68
    execution time (avg/stddev):   60.0049/0.00