issue754/test1/mysql2_thr16.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            6388470
        write:                           0
        other:                           0
        total:                           6388470
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 6388470 (106461.91 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0071s
    total number of events:              118305
    total time taken by event execution: 960.0013s
    response time:
         min:                                  6.89ms
         avg:                                  8.11ms
         max:                                196.23ms
         approx.  95 percentile:               7.85ms

Threads fairness:
    events (avg/stddev):           7394.0625/307.42
    execution time (avg/stddev):   60.0001/0.00