issue754/test1/mysql2_thr256.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            19348794
        write:                           0
        other:                           0
        total:                           19348794
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 19348794 (322353.32 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0236s
    total number of events:              358311
    total time taken by event execution: 15362.7065s
    response time:
         min:                                  8.00ms
         avg:                                 42.88ms
         max:                                432.63ms
         approx.  95 percentile:              72.34ms

Threads fairness:
    events (avg/stddev):           1399.6523/71.40
    execution time (avg/stddev):   60.0106/0.01